Documents/ЗаявлениеНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаОтпуск</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласованно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявлениеНаОтпуск/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Согласованно Тогда
		
		НовоеСогласование = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
		
		НовоеСогласование.Дата 						= ТекущаяДатаСеанса();
		НовоеСогласование.Сотрудник 				= Сотрудник;
		НовоеСогласование.ДатаНачалаОтпуска 		= ДатаНачалаОтпуска;
		НовоеСогласование.ДатаОкончанияОтпуска 		= ДатаОкончанияОтпуска;
		НовоеСогласование.ДокументОснование 		= Ссылка;
		
		НовоеСогласование.Записать();
		
		НовоеСогласование.Старт();
		
	КонецЕсли;
	
КонецПроцедуры
